{
    "intents": [
      {
        "tag": "greeting",
        "patterns": [
          "Hi",
          "Hello!",
          "Is anybody here?",
          "Assalamualaikum",
          "Hai",
          "hey",
          "heyho",
          "Hey"
        ],
        "responses": [
          "Hello, I'm BrewChat!",
          "Hey! May I help you?",
          "Oh yeah it's me here, may I help you?",
          "Hello, how can I assist you today?"
        ]
      },
      {
        "tag": "goodbye",
        "patterns": [
          "Bye",
          "Okay",
          "See you later",
          "Byebye",
          "Goodbye"
        ],
        "responses": [
          "Goodbye! If you have any more questions in the future, feel free to ask. Have a great day!",
          "Byebyee!",
          "Bye! You can come back anytime you want.",
          "Okay. Have a great day."
        ]
      },
      {
        "tag": "thanks",
        "patterns": [
          "Thanks",
          "Thank you",
          "Thank you very much",
          "thankyou",
          "Thanks for your information",
          "Thank you for your information"
        ],
        "responses": [
          "Happy to help!",
          "Any time!",
          "My pleasure",
          "Your welcome",
          "Your welcome, happy to help you anytime :)"
        ]
      },
      {
        "tag": "types",
        "patterns": [
          "What type of coffee do we have in Indonesia?",
          "What type of coffee that currently popular?",
          "What was the most delicious type of coffee?",
          "What was the most popular type of coffee?"
        ],
        "responses": [
          "Based on your quesion about type of coffee, we find some links that you can read for reference",
          "Hmmmm.... maybe these link can help you to find the answer",
          "You can check out the link that I find on below",
          "Check the link below. Hope it helps you"
        ],
        "links": []
      },
      {
        "tag": "brewing",
        "patterns": [
          "There is any way I can do to brew my on coffee beans at home?",
          "How was the technique that I can use to brewing the coffee",
          "How to create a delicious coffee?",
          "How to create a good coffee at home?"
        ],
        "responses": [
          "You can check out the link that I find on below",
          "Check the link below. Hope it helps you",
          "Hmmm.... maybe these link can help you to find the answer"
        ],
        "links": []
      },
      {
        "tag": "flavors",
        "patterns": [
          "Is coffee only have one flavors?",
          "What flavors that is barely to see in a coffee?",
          "What are the familiar flavors contained in coffee?",
          "How many coffee flavors?"
        ],
        "responses": [
          "A Coffee can have a different flavor such as chocolate, caramel, fruit, or nuts. Maybe these links can help you to find out about it",
          "The flavor of coffee can be affected by the beans that are used, the brewing technique, or the roast level of the coffee. For more information, you can visit these links below."
        ],
        "links": []
      },
      {
        "tag": "caffeine",
        "patterns": [
          "How much caffeine in a cup of coffee?",
          "Did coffee have high caffeine?",
          "What kind of coffee that has high caffeine?",
          "How to know how much caffeine is in a cup of coffee?"
        ],
        "responses": [
          "Caffeine in a cup of coffee can be diverse, it depends on the type of coffee or the way the coffee is being created. For more information, you can visit the links below",
          "You can know how much caffeine in a cup by visit this links below. I hope it helps."
        ],
        "links": []
      },
      {
        "tag": "brands",
        "patterns": [
          "What is the most famous coffee brands?",
          "What is the most famous coffee brands in Indonesia?",
          "Is there any famous coffee brands in Indonesia to find coffee beans?",
          "Is there any famous coffee brands to find coffee beans?"
        ],
        "responses": [
          "Wow, I can't choose only one specific brand. Because it's so many famous coffee brand in Indonesia that you have to taste it. But, you can see this link if you are interested.",
          "I try to figure it out some, and there is some brands that you can see by click the link below.",
          "TThere is some brands and more information about the brand that you can see by click the link below."
        ],
        "links": []
      }
    ]
  }
  