{
        "intents": [
          {
            "tag": "greeting",
            "patterns": ["Hi", "Halo!", "Ada orang kah?", "Salam kenal!", "Halo, aku .....", "P", "Assalamualaikum"],
            "responses": ["Halo, saya Chatbot!", "Haiiii! Adakah yang bisa saya bantu?", "Halo, apa ada yang bisa saya bantu?"]
          },
          {
            "tag": "goodbye",
            "patterns": ["Bye", "Dadah", "Sampai jumpa!", "See you later", "Dah"],
            "responses": ["See you later, terima kasih sudah mau mampir!", "Byebyee!", "Bye! Come back again soon yaa"]
          },
          {
            "tag": "thanks",
            "patterns": ["Thanks", "Thank you", "Terima kasih!", "Makasih","Terimakasih","thankyou"],
            "responses": ["Happy to help!", "Any time!", "My pleasure", "Sama-sama, senang bisa membantu"]
          },
          {
            "tag": "types",
            "patterns": ["Ada apa sih jenis kopi?", "Jenis kopi di Indonesia ada apa aja?", "Jenis kopi ada apa aja?"],
            "responses": ["Berdasarkan hal yang kamu tanyakan, saya menemukan tautan-tautan berikut yang bisa membantu","Hmmmm....ini adalah tautan-tautan yang saya kira bisa membantu kamu","Berdasarkan pertanyaan kamu, saya menemukan tautan-tautan berikut"],
            "links": []
          },
          {
            "tag": "brewing",
            "patterns": ["Bagaimana cara brew kopi?", "Bagaimana teknik brew kopi?", "Bagaimana cara membuat kopi yang baik?"],
            "responses": ["Yuk, coba cek tautan-tautan berikut yang saya temukan","Cek tautan-tautan berikut, semoga bisa membantu!","Hmmm.... saya menemukan tautan yang bisa membantu, yuk dicek!"],
            "links": []
          },
          {
            "tag": "flavors",
            "patterns": ["Apakah kopi punya rasa-rasa lain?", "Beritahu saya tentang rasa kopi", "Rasa apa saja yang bisa saya temukan di kopi?"],
            "responses": ["Kopi bisa punya beberapa hint rasa, seperti cokelat, karamel, buah, ataupun kacang-kacangan. Berikut adalah tautan yang bisa memberikan kamu informasi lebih lengkap! ","Rasa kopi bisa dipengaruhi oleh teknik brewing nya, atau level roast nya, dan juga oleh jenis beans nya. Berikut adalah tautan-tautan yang bisa memberi kamu informasi lebih jauh"],
            "links": []
          },
          {
            "tag": "caffeine",
            "patterns": ["Berapa tinggi kafein di kopi?", "Tingkatan kafein di kopi", "Apakah kopi memiliki kafein yang tinggi?"],
            "responses": ["Kafein di dalam kopi bisa beragam, dipengaruhi oleh jenis beans yang digunakan ataupun metode pengolahannya. Untuk informasi lebih lengkap, kamu bisa cek tautan-tautan berikut", "Rata-rata kopi memiliki kafein sebanyak 95mg. Berikut adalah tautan yang memiliki informasi lebih lengkap mengenai hal tersebut. Semoga membantu!"],
            "links": []
          },
          {
            "tag": "brands",
            "patterns": ["Apa brand kopi yang terkenal di Indonesia?", "Apa brand kopi yang disukai di Indonesia?", "Sebutin dong beberapa brand kopi terkenal yang ada di Indonesia"],
            "responses": ["Banyak sekali brand kopi yang terkenal di Indonesia. Namun jika harus memilih, ini beberapa tautan tentang beberapa brand kopi yang ada di Indonesia yang mungkin kamu suka.", "Menarik. Saya mencoba mencari tahu beberapa brand kopi terkenal yang ada di Indonesia, mungkin kamu bisa cari tau beberapa brand yang tautannya ada di bawah."],
            "links": []
          }
        ]
      }
      